[
  {
    "name": "Spaghetti Carbonara",
    "ingredients": [
      "200g spaghetti",
      "100g pancetta",
      "2 large eggs",
      "50g pecorino cheese",
      "50g parmesan cheese",
      "Freshly ground black pepper",
      "Salt",
      "2 cloves garlic",
      "1 tbsp olive oil"
    ],
    "instructions": [
      "Cook the spaghetti in a large pot of salted boiling water according to package instructions.",
      "While the pasta is cooking, heat the olive oil in a pan and sauté the pancetta until crispy. Add garlic and cook until fragrant.",
      "In a bowl, beat the eggs and mix in the grated pecorino and parmesan cheeses.",
      "Drain the pasta, reserving some of the cooking water.",
      "Quickly mix the hot pasta with the pancetta and garlic, then remove from heat.",
      "Stir in the egg and cheese mixture, using some reserved pasta water to achieve a creamy consistency.",
      "Season with freshly ground black pepper and serve immediately."
    ],
    "category": "Pasta"
  },
  {
    "name": "Chicken Tikka Masala",
    "ingredients": [
      "500g boneless chicken thighs",
      "1 cup yogurt",
      "2 tbsp tikka masala paste",
      "1 onion",
      "2 cloves garlic",
      "1-inch piece of ginger",
      "1 can (400g) diced tomatoes",
      "200ml cream",
      "1 tsp cumin",
      "1 tsp coriander powder",
      "1 tsp paprika",
      "1 tsp turmeric",
      "1 tbsp olive oil",
      "Fresh cilantro for garnish",
      "Salt"
    ],
    "instructions": [
      "Marinate the chicken in yogurt and tikka masala paste for at least 1 hour or overnight.",
      "Heat oil in a pan and sauté the chopped onions, garlic, and ginger until softened.",
      "Add the spices (cumin, coriander, paprika, and turmeric) and cook for a few minutes.",
      "Add the marinated chicken and cook until browned on all sides.",
      "Stir in the diced tomatoes and cook until the sauce thickens.",
      "Lower the heat and stir in the cream. Simmer for 10 minutes.",
      "Garnish with fresh cilantro and serve with rice or naan."
    ],
    "category": "Indian"
  },
  {
    "name": "Classic Pancakes",
    "ingredients": [
      "1 cup all-purpose flour",
      "2 tbsp sugar",
      "1 tsp baking powder",
      "1/2 tsp baking soda",
      "1/4 tsp salt",
      "1 cup buttermilk",
      "1 large egg",
      "2 tbsp melted butter",
      "1 tsp vanilla extract"
    ],
    "instructions": [
      "In a bowl, whisk together the flour, sugar, baking powder, baking soda, and salt.",
      "In another bowl, mix the buttermilk, egg, melted butter, and vanilla extract.",
      "Gradually combine the wet ingredients with the dry ingredients, stirring until just mixed.",
      "Heat a non-stick pan over medium heat and pour batter to form small pancakes.",
      "Cook until bubbles form on the surface, then flip and cook until golden brown.",
      "Serve with maple syrup, fresh fruits, or your favorite toppings."
    ],
    "category": "Breakfast"
  }
]
